MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
extern volatile DMACH6BITS DMACH6bits __attribute__((__sfr__));

#define DMAINT6 DMAINT6
extern volatile uint16_t DMAINT6 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT6BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT6BITS;
extern volatile DMAINT6BITS DMAINT6bits __attribute__((__sfr__));

#define DMASRC6 DMASRC6
extern volatile uint16_t DMASRC6 __attribute__((__sfr__));
#define DMADST6 DMADST6
extern volatile uint16_t DMADST6 __attribute__((__sfr__));
#define DMACNT6 DMACNT6
extern volatile uint16_t DMACNT6 __attribute__((__sfr__));
#define DMACH7 DMACH7
extern volatile uint16_t DMACH7 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH7BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH7BITS;
extern volatile DMACH7BITS DMACH7bits __attribute__((__sfr__));

#define DMAINT7 DMAINT7
extern volatile uint16_t DMAINT7 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT7BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT7BITS;
extern volatile DMAINT7BITS DMAINT7bits __attribute__((__sfr__));

#define DMASRC7 DMASRC7
extern volatile uint16_t DMASRC7 __attribute__((__sfr__));
#define DMADST7 DMADST7
extern volatile uint16_t DMADST7 __attribute__((__sfr__));
#define DMACNT7 DMACNT7
extern volatile uint16_t DMACNT7 __attribute__((__sfr__));
#define PADCON PADCON
extern volatile uint16_t PADCON __attribute__((__sfr__));
typedef struct tagPADCONBITS {
  uint16_t PMPTTL:1;
  uint16_t :14;
  uint16_t IOCON:1;
} PADCONBITS;
extern volatile PADCONBITS PADCONbits __attribute__((__sfr__));

#define IOCSTAT IOCSTAT
extern volatile uint16_t IOCSTAT __attribute__((__sfr__));
typedef struct tagIOCSTATBITS {
  uint16_t :1;
  uint16_t IOCPBF:1;
  uint16_t IOCPCF:1;
  uint16_t IOCPDF:1;
  uint16_t IOCPEF:1;
  uint16_t IOCPFF:1;
  uint16_t IOCPGF:1;
} IOCSTATBITS;
extern volatile IOCSTATBITS IOCSTATbits __attribute__((__sfr__));

#define TRISB TRISB
extern volatile uint16_t TRISB __attribute__((__sfr__));
typedef struct tagTRISBBITS {
  uint16_t TRISB0:1;
  uint16_t TRISB1:1;
  uint16_t TRISB2:1;
  uint16_t TRISB3:1;
  uint16_t TRISB4:1;
  uint16_t TRISB5:1;
  uint16_t TRISB6:1;
  uint16_t TRISB7:1;
  uint16_t TRISB8:1;
  uint16_t TRISB9:1;
  uint16_t TRISB10:1;
  uint16_t TRISB11:1;
  uint16_t TRISB12:1;
  uint16_t TRISB13:1;
  uint16_t TRISB14:1;
  uint16_t TRISB15:1;
} TRISBBITS;
extern volatile TRISBBITS TRISBbits __attribute__((__sfr__));

#define PORTB PORTB
extern volatile uint16_t PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  uint16_t RB0:1;
  uint16_t RB1:1;
  uint16_t RB2:1;
  uint16_t RB3:1;
  uint16_t RB4:1;
  uint16_t RB5:1;
  uint16_t RB6:1;
  uint16_t RB7:1;
  uint16_t RB8:1;
  uint16_t RB9:1;
  uint16_t RB10:1;
  uint16_t RB11:1;
  uint16_t RB12:1;
  uint16_t RB13:1;
  uint16_t RB14:1;
  uint16_t RB15:1;
} PORTBBITS;
extern volatile PORTBBITS PORTBbits __attribute__((__sfr__));

#define LATB LATB
extern volatile uint16_t LATB __attribute__((__sfr__));
typedef struct tagLATBBITS {
  uint16_t LATB0:1;
  uint16_t LATB1:1;
  uint16_t LATB2:1;
  uint16_t LATB3:1;
  uint16_t LATB4:1;
  uint16_t LATB5:1;
  uint16_t LATB6:1;
  uint16_t LATB7:1;
  uint16_t LATB8:1;
  uint16_t LATB9:1;
  uint16_t LATB10:1;
  uint16_t LATB11:1;
  uint16_t LATB12:1;
  uint16_t LATB13:1;
  uint16_t LATB14:1;
  uint16_t LATB15:1;
} LATBBITS;
extern volatile LATBBITS LATBbits __attribute__((__sfr__));

#define ODCB ODCB
extern volatile uint16_t ODCB __attribute__((__sfr__));
typedef struct tagODCBBITS {
  uint16_t ODCB0:1;
  uint16_t ODCB1:1;
  uint16_t ODCB2:1;
  uint16_t ODCB3:1;
  uint16_t ODCB4:1;
  uint16_t ODCB5:1;
  uint16_t ODCB6:1;
  uint16_t ODCB7:1;
  uint16_t ODCB8:1;
  uint16_t ODCB9:1;
  uint16_t ODCB10:1;
  uint16_t ODCB11:1;
  uint16_t ODCB12:1;
  uint16_t ODCB13:1;
  uint16_t ODCB14:1;
  uint16_t ODCB15:1;
} ODCBBITS;
extern volatile ODCBBITS ODCBbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t ANSB10:1;
      uint16_t ANSB11:1;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t ANSELB10:1;
      uint16_t ANSELB11:1;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t ANSB10:1;
      uint16_t ANSB11:1;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t ANSELB10:1;
      uint16_t ANSELB11:1;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define IOCPB IOCPB
extern volatile uint16_t IOCPB __attribute__((__sfr__));
typedef struct tagIOCPBBITS {
  uint16_t IOCPB0:1;
  uint16_t IOCPB1:1;
  uint16_t IOCPB2:1;
  uint16_t IOCPB3:1;
  uint16_t IOCPB4:1;
  uint16_t IOCPB5:1;
  uint16_t IOCPB6:1;
  uint16_t IOCPB7:1;
  uint16_t IOCPB8:1;
  uint16_t IOCPB9:1;
  uint16_t IOCPB10:1;
  uint16_t IOCPB11:1;
  uint16_t IOCPB12:1;
  uint16_t IOCPB13:1;
  uint16_t IOCPB14:1;
  uint16_t IOCPB15:1;
} IOCPBBITS;
extern volatile IOCPBBITS IOCPBbits __attribute__((__sfr__));

