MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
/* IOCNB */
#define _IOCNB0 IOCNBbits.IOCNB0
#define _IOCNB1 IOCNBbits.IOCNB1
#define _IOCNB2 IOCNBbits.IOCNB2
#define _IOCNB3 IOCNBbits.IOCNB3
#define _IOCNB4 IOCNBbits.IOCNB4
#define _IOCNB5 IOCNBbits.IOCNB5
#define _IOCNB6 IOCNBbits.IOCNB6
#define _IOCNB7 IOCNBbits.IOCNB7
#define _IOCNB8 IOCNBbits.IOCNB8
#define _IOCNB9 IOCNBbits.IOCNB9
#define _IOCNB10 IOCNBbits.IOCNB10
#define _IOCNB11 IOCNBbits.IOCNB11
#define _IOCNB12 IOCNBbits.IOCNB12
#define _IOCNB13 IOCNBbits.IOCNB13
#define _IOCNB14 IOCNBbits.IOCNB14
#define _IOCNB15 IOCNBbits.IOCNB15

/* IOCFB */
#define _IOCFB0 IOCFBbits.IOCFB0
#define _IOCFB1 IOCFBbits.IOCFB1
#define _IOCFB2 IOCFBbits.IOCFB2
#define _IOCFB3 IOCFBbits.IOCFB3
#define _IOCFB4 IOCFBbits.IOCFB4
#define _IOCFB5 IOCFBbits.IOCFB5
#define _IOCFB6 IOCFBbits.IOCFB6
#define _IOCFB7 IOCFBbits.IOCFB7
#define _IOCFB8 IOCFBbits.IOCFB8
#define _IOCFB9 IOCFBbits.IOCFB9
#define _IOCFB10 IOCFBbits.IOCFB10
#define _IOCFB11 IOCFBbits.IOCFB11
#define _IOCFB12 IOCFBbits.IOCFB12
#define _IOCFB13 IOCFBbits.IOCFB13
#define _IOCFB14 IOCFBbits.IOCFB14
#define _IOCFB15 IOCFBbits.IOCFB15

/* CNPUB */
/* Bitname _IOCPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB15 cannot be defined because it is used by more than one SFR */
#define _IOCPUB0 CNPUBbits.IOCPUB0
#define _IOCPUB1 CNPUBbits.IOCPUB1
#define _IOCPUB2 CNPUBbits.IOCPUB2
#define _IOCPUB3 CNPUBbits.IOCPUB3
#define _IOCPUB4 CNPUBbits.IOCPUB4
#define _IOCPUB5 CNPUBbits.IOCPUB5
#define _IOCPUB6 CNPUBbits.IOCPUB6
#define _IOCPUB7 CNPUBbits.IOCPUB7
#define _IOCPUB8 CNPUBbits.IOCPUB8
#define _IOCPUB9 CNPUBbits.IOCPUB9
#define _IOCPUB10 CNPUBbits.IOCPUB10
#define _IOCPUB11 CNPUBbits.IOCPUB11
#define _IOCPUB12 CNPUBbits.IOCPUB12
#define _IOCPUB13 CNPUBbits.IOCPUB13
#define _IOCPUB14 CNPUBbits.IOCPUB14
#define _IOCPUB15 CNPUBbits.IOCPUB15
#define _CNPUB0 CNPUBbits.CNPUB0
#define _CNPUB1 CNPUBbits.CNPUB1
#define _CNPUB2 CNPUBbits.CNPUB2
#define _CNPUB3 CNPUBbits.CNPUB3
#define _CNPUB4 CNPUBbits.CNPUB4
#define _CNPUB5 CNPUBbits.CNPUB5
#define _CNPUB6 CNPUBbits.CNPUB6
#define _CNPUB7 CNPUBbits.CNPUB7
#define _CNPUB8 CNPUBbits.CNPUB8
#define _CNPUB9 CNPUBbits.CNPUB9
#define _CNPUB10 CNPUBbits.CNPUB10
#define _CNPUB11 CNPUBbits.CNPUB11
#define _CNPUB12 CNPUBbits.CNPUB12
#define _CNPUB13 CNPUBbits.CNPUB13
#define _CNPUB14 CNPUBbits.CNPUB14
#define _CNPUB15 CNPUBbits.CNPUB15

/* CNPDB */
#define _IOCPDB0 CNPDBbits.IOCPDB0
#define _IOCPDB1 CNPDBbits.IOCPDB1
#define _IOCPDB2 CNPDBbits.IOCPDB2
#define _IOCPDB3 CNPDBbits.IOCPDB3
#define _IOCPDB4 CNPDBbits.IOCPDB4
#define _IOCPDB5 CNPDBbits.IOCPDB5
#define _IOCPDB6 CNPDBbits.IOCPDB6
#define _IOCPDB7 CNPDBbits.IOCPDB7
#define _IOCPDB8 CNPDBbits.IOCPDB8
#define _IOCPDB9 CNPDBbits.IOCPDB9
#define _IOCPDB10 CNPDBbits.IOCPDB10
#define _IOCPDB11 CNPDBbits.IOCPDB11
#define _IOCPDB12 CNPDBbits.IOCPDB12
#define _IOCPDB13 CNPDBbits.IOCPDB13
#define _IOCPDB14 CNPDBbits.IOCPDB14
#define _IOCPDB15 CNPDBbits.IOCPDB15
#define _CNPDB0 CNPDBbits.CNPDB0
#define _CNPDB1 CNPDBbits.CNPDB1
#define _CNPDB2 CNPDBbits.CNPDB2
#define _CNPDB3 CNPDBbits.CNPDB3
#define _CNPDB4 CNPDBbits.CNPDB4
#define _CNPDB5 CNPDBbits.CNPDB5
#define _CNPDB6 CNPDBbits.CNPDB6
#define _CNPDB7 CNPDBbits.CNPDB7
#define _CNPDB8 CNPDBbits.CNPDB8
#define _CNPDB9 CNPDBbits.CNPDB9
#define _CNPDB10 CNPDBbits.CNPDB10
#define _CNPDB11 CNPDBbits.CNPDB11
#define _CNPDB12 CNPDBbits.CNPDB12
#define _CNPDB13 CNPDBbits.CNPDB13
#define _CNPDB14 CNPDBbits.CNPDB14
#define _CNPDB15 CNPDBbits.CNPDB15

/* TRISC */
#define _TRISC12 TRISCbits.TRISC12
#define _TRISC13 TRISCbits.TRISC13
#define _TRISC14 TRISCbits.TRISC14
#define _TRISC15 TRISCbits.TRISC15

/* PORTC */
#define _RC12 PORTCbits.RC12
#define _RC13 PORTCbits.RC13
#define _RC14 PORTCbits.RC14
#define _RC15 PORTCbits.RC15

/* LATC */
#define _LATC12 LATCbits.LATC12
#define _LATC13 LATCbits.LATC13
#define _LATC14 LATCbits.LATC14
#define _LATC15 LATCbits.LATC15

/* ODCC */
#define _ODCC12 ODCCbits.ODCC12
#define _ODCC13 ODCCbits.ODCC13
#define _ODCC14 ODCCbits.ODCC14
#define _ODCC15 ODCCbits.ODCC15

/* ANSC */
#define _ANSC13 ANSCbits.ANSC13
#define _ANSC14 ANSCbits.ANSC14
#define _ANSELC13 ANSCbits.ANSELC13
#define _ANSELC14 ANSCbits.ANSELC14

/* IOCPC */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */

/* IOCNC */
#define _IOCNC12 IOCNCbits.IOCNC12
#define _IOCNC13 IOCNCbits.IOCNC13
#define _IOCNC14 IOCNCbits.IOCNC14
#define _IOCNC15 IOCNCbits.IOCNC15

/* IOCFC */
#define _IOCFC12 IOCFCbits.IOCFC12
#define _IOCFC13 IOCFCbits.IOCFC13
#define _IOCFC14 IOCFCbits.IOCFC14
#define _IOCFC15 IOCFCbits.IOCFC15

/* CNPUC */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */
#define _IOCPUC12 CNPUCbits.IOCPUC12
#define _IOCPUC13 CNPUCbits.IOCPUC13
#define _IOCPUC14 CNPUCbits.IOCPUC14
#define _IOCPUC15 CNPUCbits.IOCPUC15
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC13 CNPUCbits.CNPUC13
#define _CNPUC14 CNPUCbits.CNPUC14
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _IOCPDC12 CNPDCbits.IOCPDC12
#define _IOCPDC13 CNPDCbits.IOCPDC13
#define _IOCPDC14 CNPDCbits.IOCPDC14
#define _IOCPDC15 CNPDCbits.IOCPDC15
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC13 CNPDCbits.CNPDC13
#define _CNPDC14 CNPDCbits.CNPDC14
#define _CNPDC15 CNPDCbits.CNPDC15

/* TRISD */
#define _TRISD0 TRISDbits.TRISD0
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD2 TRISDbits.TRISD2
#define _TRISD3 TRISDbits.TRISD3
#define _TRISD4 TRISDbits.TRISD4
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD7 TRISDbits.TRISD7
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD9 TRISDbits.TRISD9
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD11 TRISDbits.TRISD11

/* PORTD */
#define _RD0 PORTDbits.RD0
#define _RD1 PORTDbits.RD1
#define _RD2 PORTDbits.RD2
#define _RD3 PORTDbits.RD3
#define _RD4 PORTDbits.RD4
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD7 PORTDbits.RD7
#define _RD8 PORTDbits.RD8
#define _RD9 PORTDbits.RD9
#define _RD10 PORTDbits.RD10
#define _RD11 PORTDbits.RD11

