MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
#define _IPC25_CCT1IP0_POSITION                  0x00000004
#define _IPC25_CCT1IP0_MASK                      0x00000010
#define _IPC25_CCT1IP0_LENGTH                    0x00000001

#define _IPC25_CCT1IP1_POSITION                  0x00000005
#define _IPC25_CCT1IP1_MASK                      0x00000020
#define _IPC25_CCT1IP1_LENGTH                    0x00000001

#define _IPC25_CCT1IP2_POSITION                  0x00000006
#define _IPC25_CCT1IP2_MASK                      0x00000040
#define _IPC25_CCT1IP2_LENGTH                    0x00000001

#define _IPC25_CCT2IP0_POSITION                  0x00000008
#define _IPC25_CCT2IP0_MASK                      0x00000100
#define _IPC25_CCT2IP0_LENGTH                    0x00000001

#define _IPC25_CCT2IP1_POSITION                  0x00000009
#define _IPC25_CCT2IP1_MASK                      0x00000200
#define _IPC25_CCT2IP1_LENGTH                    0x00000001

#define _IPC25_CCT2IP2_POSITION                  0x0000000A
#define _IPC25_CCT2IP2_MASK                      0x00000400
#define _IPC25_CCT2IP2_LENGTH                    0x00000001

#define _IPC26_FSTIP_POSITION                    0x00000008
#define _IPC26_FSTIP_MASK                        0x00000700
#define _IPC26_FSTIP_LENGTH                      0x00000003

#define _IPC26_FSTIP0_POSITION                   0x00000008
#define _IPC26_FSTIP0_MASK                       0x00000100
#define _IPC26_FSTIP0_LENGTH                     0x00000001

#define _IPC26_FSTIP1_POSITION                   0x00000009
#define _IPC26_FSTIP1_MASK                       0x00000200
#define _IPC26_FSTIP1_LENGTH                     0x00000001

#define _IPC26_FSTIP2_POSITION                   0x0000000A
#define _IPC26_FSTIP2_MASK                       0x00000400
#define _IPC26_FSTIP2_LENGTH                     0x00000001

#define _IPC27_I2C3BCIP_POSITION                 0x00000004
#define _IPC27_I2C3BCIP_MASK                     0x00000070
#define _IPC27_I2C3BCIP_LENGTH                   0x00000003

#define _IPC27_RTCCTSIP_POSITION                 0x00000008
#define _IPC27_RTCCTSIP_MASK                     0x00000700
#define _IPC27_RTCCTSIP_LENGTH                   0x00000003

#define _IPC27_U5RXIP_POSITION                   0x0000000C
#define _IPC27_U5RXIP_MASK                       0x00007000
#define _IPC27_U5RXIP_LENGTH                     0x00000003

#define _IPC27_I2C3BCIP0_POSITION                0x00000004
#define _IPC27_I2C3BCIP0_MASK                    0x00000010
#define _IPC27_I2C3BCIP0_LENGTH                  0x00000001

#define _IPC27_I2C3BCIP1_POSITION                0x00000005
#define _IPC27_I2C3BCIP1_MASK                    0x00000020
#define _IPC27_I2C3BCIP1_LENGTH                  0x00000001

#define _IPC27_I2C3BCIP2_POSITION                0x00000006
#define _IPC27_I2C3BCIP2_MASK                    0x00000040
#define _IPC27_I2C3BCIP2_LENGTH                  0x00000001

#define _IPC27_RTCCTCIP0_POSITION                0x00000008
#define _IPC27_RTCCTCIP0_MASK                    0x00000100
#define _IPC27_RTCCTCIP0_LENGTH                  0x00000001

#define _IPC27_RTCCTSIP1_POSITION                0x00000009
#define _IPC27_RTCCTSIP1_MASK                    0x00000200
#define _IPC27_RTCCTSIP1_LENGTH                  0x00000001

#define _IPC27_RTCCTSIP2_POSITION                0x0000000A
#define _IPC27_RTCCTSIP2_MASK                    0x00000400
#define _IPC27_RTCCTSIP2_LENGTH                  0x00000001

#define _IPC27_U5RXIP0_POSITION                  0x0000000C
#define _IPC27_U5RXIP0_MASK                      0x00001000
#define _IPC27_U5RXIP0_LENGTH                    0x00000001

#define _IPC27_U5RXIP1_POSITION                  0x0000000D
#define _IPC27_U5RXIP1_MASK                      0x00002000
#define _IPC27_U5RXIP1_LENGTH                    0x00000001

#define _IPC27_U5RXIP2_POSITION                  0x0000000E
#define _IPC27_U5RXIP2_MASK                      0x00004000
#define _IPC27_U5RXIP2_LENGTH                    0x00000001

#define _IPC28_U5TXIP_POSITION                   0x00000000
#define _IPC28_U5TXIP_MASK                       0x00000007
#define _IPC28_U5TXIP_LENGTH                     0x00000003

#define _IPC28_U5ERIP_POSITION                   0x00000004
#define _IPC28_U5ERIP_MASK                       0x00000070
#define _IPC28_U5ERIP_LENGTH                     0x00000003

#define _IPC28_U6RXIP_POSITION                   0x00000008
#define _IPC28_U6RXIP_MASK                       0x00000700
#define _IPC28_U6RXIP_LENGTH                     0x00000003

#define _IPC28_U6TXIP_POSITION                   0x0000000C
#define _IPC28_U6TXIP_MASK                       0x00007000
#define _IPC28_U6TXIP_LENGTH                     0x00000003

#define _IPC28_U5TXIP0_POSITION                  0x00000000
#define _IPC28_U5TXIP0_MASK                      0x00000001
#define _IPC28_U5TXIP0_LENGTH                    0x00000001

#define _IPC28_U5TXIP1_POSITION                  0x00000001
#define _IPC28_U5TXIP1_MASK                      0x00000002
#define _IPC28_U5TXIP1_LENGTH                    0x00000001

#define _IPC28_U5TXIP2_POSITION                  0x00000002
#define _IPC28_U5TXIP2_MASK                      0x00000004
#define _IPC28_U5TXIP2_LENGTH                    0x00000001

#define _IPC28_U5ERIP0_POSITION                  0x00000004
#define _IPC28_U5ERIP0_MASK                      0x00000010
#define _IPC28_U5ERIP0_LENGTH                    0x00000001

#define _IPC28_U5ERIP1_POSITION                  0x00000005
#define _IPC28_U5ERIP1_MASK                      0x00000020
#define _IPC28_U5ERIP1_LENGTH                    0x00000001

#define _IPC28_U5ERIP2_POSITION                  0x00000006
#define _IPC28_U5ERIP2_MASK                      0x00000040
#define _IPC28_U5ERIP2_LENGTH                    0x00000001

#define _IPC28_U6RXIP0_POSITION                  0x00000008
#define _IPC28_U6RXIP0_MASK                      0x00000100
#define _IPC28_U6RXIP0_LENGTH                    0x00000001

#define _IPC28_U6RXIP1_POSITION                  0x00000009
#define _IPC28_U6RXIP1_MASK                      0x00000200
#define _IPC28_U6RXIP1_LENGTH                    0x00000001

#define _IPC28_U6RXIP2_POSITION                  0x0000000A
#define _IPC28_U6RXIP2_MASK                      0x00000400
#define _IPC28_U6RXIP2_LENGTH                    0x00000001

#define _IPC28_U6TXIP0_POSITION                  0x0000000C
#define _IPC28_U6TXIP0_MASK                      0x00001000
#define _IPC28_U6TXIP0_LENGTH                    0x00000001

#define _IPC28_U6TXIP1_POSITION                  0x0000000D
#define _IPC28_U6TXIP1_MASK                      0x00002000
#define _IPC28_U6TXIP1_LENGTH                    0x00000001

#define _IPC28_U6TXIP2_POSITION                  0x0000000E
#define _IPC28_U6TXIP2_MASK                      0x00004000
#define _IPC28_U6TXIP2_LENGTH                    0x00000001

#define _IPC29_U6ERIP_POSITION                   0x00000000
#define _IPC29_U6ERIP_MASK                       0x00000007
#define _IPC29_U6ERIP_LENGTH                     0x00000003

#define _IPC29_JTAGIP_POSITION                   0x00000004
#define _IPC29_JTAGIP_MASK                       0x00000070
#define _IPC29_JTAGIP_LENGTH                     0x00000003

