MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
#define _RCON_SBOREN_POSITION                    0x0000000D
#define _RCON_SBOREN_MASK                        0x00002000
#define _RCON_SBOREN_LENGTH                      0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _RCON_PMSLP_POSITION                     0x00000008
#define _RCON_PMSLP_MASK                         0x00000100
#define _RCON_PMSLP_LENGTH                       0x00000001

#define _HLVDCON_HLVDL_POSITION                  0x00000000
#define _HLVDCON_HLVDL_MASK                      0x0000000F
#define _HLVDCON_HLVDL_LENGTH                    0x00000004

#define _HLVDCON_LVDEVT_POSITION                 0x00000008
#define _HLVDCON_LVDEVT_MASK                     0x00000100
#define _HLVDCON_LVDEVT_LENGTH                   0x00000001

#define _HLVDCON_IRVST_POSITION                  0x00000009
#define _HLVDCON_IRVST_MASK                      0x00000200
#define _HLVDCON_IRVST_LENGTH                    0x00000001

#define _HLVDCON_BGVST_POSITION                  0x0000000A
#define _HLVDCON_BGVST_MASK                      0x00000400
#define _HLVDCON_BGVST_LENGTH                    0x00000001

#define _HLVDCON_VDIR_POSITION                   0x0000000B
#define _HLVDCON_VDIR_MASK                       0x00000800
#define _HLVDCON_VDIR_LENGTH                     0x00000001

#define _HLVDCON_LSIDL_POSITION                  0x0000000D
#define _HLVDCON_LSIDL_MASK                      0x00002000
#define _HLVDCON_LSIDL_LENGTH                    0x00000001

#define _HLVDCON_HLVDEN_POSITION                 0x0000000F
#define _HLVDCON_HLVDEN_MASK                     0x00008000
#define _HLVDCON_HLVDEN_LENGTH                   0x00000001

#define _HLVDCON_HLVDL0_POSITION                 0x00000000
#define _HLVDCON_HLVDL0_MASK                     0x00000001
#define _HLVDCON_HLVDL0_LENGTH                   0x00000001

#define _HLVDCON_HLVDL1_POSITION                 0x00000001
#define _HLVDCON_HLVDL1_MASK                     0x00000002
#define _HLVDCON_HLVDL1_LENGTH                   0x00000001

#define _HLVDCON_HLVDL2_POSITION                 0x00000002
#define _HLVDCON_HLVDL2_MASK                     0x00000004
#define _HLVDCON_HLVDL2_LENGTH                   0x00000001

#define _HLVDCON_HLVDL3_POSITION                 0x00000003
#define _HLVDCON_HLVDL3_MASK                     0x00000008
#define _HLVDCON_HLVDL3_LENGTH                   0x00000001

#define _PMCON1_IRQM_POSITION                    0x00000000
#define _PMCON1_IRQM_MASK                        0x00000003
#define _PMCON1_IRQM_LENGTH                      0x00000002

#define _PMCON1_BUSKEEP_POSITION                 0x00000002
#define _PMCON1_BUSKEEP_MASK                     0x00000004
#define _PMCON1_BUSKEEP_LENGTH                   0x00000001

#define _PMCON1_ALMODE_POSITION                  0x00000004
#define _PMCON1_ALMODE_MASK                      0x00000010
#define _PMCON1_ALMODE_LENGTH                    0x00000001

#define _PMCON1_ALP_POSITION                     0x00000005
#define _PMCON1_ALP_MASK                         0x00000020
#define _PMCON1_ALP_LENGTH                       0x00000001

#define _PMCON1_CSF_POSITION                     0x00000006
#define _PMCON1_CSF_MASK                         0x000000C0
#define _PMCON1_CSF_LENGTH                       0x00000002

#define _PMCON1_MODE_POSITION                    0x00000008
#define _PMCON1_MODE_MASK                        0x00000300
#define _PMCON1_MODE_LENGTH                      0x00000002

#define _PMCON1_ADRMUX_POSITION                  0x0000000B
#define _PMCON1_ADRMUX_MASK                      0x00001800
#define _PMCON1_ADRMUX_LENGTH                    0x00000002

#define _PMCON1_PSIDL_POSITION                   0x0000000D
#define _PMCON1_PSIDL_MASK                       0x00002000
#define _PMCON1_PSIDL_LENGTH                     0x00000001

#define _PMCON1_PMPEN_POSITION                   0x0000000F
#define _PMCON1_PMPEN_MASK                       0x00008000
#define _PMCON1_PMPEN_LENGTH                     0x00000001

#define _PMCON1_IRQM0_POSITION                   0x00000000
#define _PMCON1_IRQM0_MASK                       0x00000001
#define _PMCON1_IRQM0_LENGTH                     0x00000001

#define _PMCON1_IRQM1_POSITION                   0x00000001
#define _PMCON1_IRQM1_MASK                       0x00000002
#define _PMCON1_IRQM1_LENGTH                     0x00000001

#define _PMCON1_CSF0_POSITION                    0x00000006
#define _PMCON1_CSF0_MASK                        0x00000040
#define _PMCON1_CSF0_LENGTH                      0x00000001

#define _PMCON1_CSF1_POSITION                    0x00000007
#define _PMCON1_CSF1_MASK                        0x00000080
#define _PMCON1_CSF1_LENGTH                      0x00000001

#define _PMCON1_MODE0_POSITION                   0x00000008
#define _PMCON1_MODE0_MASK                       0x00000100
#define _PMCON1_MODE0_LENGTH                     0x00000001

#define _PMCON1_MODE1_POSITION                   0x00000009
#define _PMCON1_MODE1_MASK                       0x00000200
#define _PMCON1_MODE1_LENGTH                     0x00000001

#define _PMCON1_ADRMUX0_POSITION                 0x0000000B
#define _PMCON1_ADRMUX0_MASK                     0x00000800
#define _PMCON1_ADRMUX0_LENGTH                   0x00000001

#define _PMCON1_ADRMUX1_POSITION                 0x0000000C
#define _PMCON1_ADRMUX1_MASK                     0x00001000
#define _PMCON1_ADRMUX1_LENGTH                   0x00000001

#define _PMCON2_RADDR_POSITION                   0x00000000
#define _PMCON2_RADDR_MASK                       0x000000FF
#define _PMCON2_RADDR_LENGTH                     0x00000008

#define _PMCON2_TIMEOUT_POSITION                 0x0000000C
#define _PMCON2_TIMEOUT_MASK                     0x00001000
#define _PMCON2_TIMEOUT_LENGTH                   0x00000001

#define _PMCON2_ERROR_POSITION                   0x0000000D
#define _PMCON2_ERROR_MASK                       0x00002000
#define _PMCON2_ERROR_LENGTH                     0x00000001

#define _PMCON2_BUSY_POSITION                    0x0000000F
#define _PMCON2_BUSY_MASK                        0x00008000
#define _PMCON2_BUSY_LENGTH                      0x00000001

