MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
#define _U6ADMD_ADMMASK_POSITION                 0x00000008
#define _U6ADMD_ADMMASK_MASK                     0x0000FF00
#define _U6ADMD_ADMMASK_LENGTH                   0x00000008

#define _U6ADMD_ADMADDR0_POSITION                0x00000000
#define _U6ADMD_ADMADDR0_MASK                    0x00000001
#define _U6ADMD_ADMADDR0_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR1_POSITION                0x00000001
#define _U6ADMD_ADMADDR1_MASK                    0x00000002
#define _U6ADMD_ADMADDR1_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR2_POSITION                0x00000002
#define _U6ADMD_ADMADDR2_MASK                    0x00000004
#define _U6ADMD_ADMADDR2_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR3_POSITION                0x00000003
#define _U6ADMD_ADMADDR3_MASK                    0x00000008
#define _U6ADMD_ADMADDR3_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR4_POSITION                0x00000004
#define _U6ADMD_ADMADDR4_MASK                    0x00000010
#define _U6ADMD_ADMADDR4_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR5_POSITION                0x00000005
#define _U6ADMD_ADMADDR5_MASK                    0x00000020
#define _U6ADMD_ADMADDR5_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR6_POSITION                0x00000006
#define _U6ADMD_ADMADDR6_MASK                    0x00000040
#define _U6ADMD_ADMADDR6_LENGTH                  0x00000001

#define _U6ADMD_ADMADDR7_POSITION                0x00000007
#define _U6ADMD_ADMADDR7_MASK                    0x00000080
#define _U6ADMD_ADMADDR7_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK0_POSITION                0x00000008
#define _U6ADMD_ADMMASK0_MASK                    0x00000100
#define _U6ADMD_ADMMASK0_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK1_POSITION                0x00000009
#define _U6ADMD_ADMMASK1_MASK                    0x00000200
#define _U6ADMD_ADMMASK1_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK2_POSITION                0x0000000A
#define _U6ADMD_ADMMASK2_MASK                    0x00000400
#define _U6ADMD_ADMMASK2_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK3_POSITION                0x0000000B
#define _U6ADMD_ADMMASK3_MASK                    0x00000800
#define _U6ADMD_ADMMASK3_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK4_POSITION                0x0000000C
#define _U6ADMD_ADMMASK4_MASK                    0x00001000
#define _U6ADMD_ADMMASK4_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK5_POSITION                0x0000000D
#define _U6ADMD_ADMMASK5_MASK                    0x00002000
#define _U6ADMD_ADMMASK5_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK6_POSITION                0x0000000E
#define _U6ADMD_ADMMASK6_MASK                    0x00004000
#define _U6ADMD_ADMMASK6_LENGTH                  0x00000001

#define _U6ADMD_ADMMASK7_POSITION                0x0000000F
#define _U6ADMD_ADMMASK7_MASK                    0x00008000
#define _U6ADMD_ADMMASK7_LENGTH                  0x00000001

#define _SPI1CON1_ENHBUF_POSITION                0x00000000
#define _SPI1CON1_ENHBUF_MASK                    0x00000001
#define _SPI1CON1_ENHBUF_LENGTH                  0x00000001

#define _SPI1CON1_SPIFE_POSITION                 0x00000001
#define _SPI1CON1_SPIFE_MASK                     0x00000002
#define _SPI1CON1_SPIFE_LENGTH                   0x00000001

#define _SPI1CON1_MCLKEN_POSITION                0x00000002
#define _SPI1CON1_MCLKEN_MASK                    0x00000004
#define _SPI1CON1_MCLKEN_LENGTH                  0x00000001

#define _SPI1CON1_DISSCK_POSITION                0x00000003
#define _SPI1CON1_DISSCK_MASK                    0x00000008
#define _SPI1CON1_DISSCK_LENGTH                  0x00000001

#define _SPI1CON1_DISSDI_POSITION                0x00000004
#define _SPI1CON1_DISSDI_MASK                    0x00000010
#define _SPI1CON1_DISSDI_LENGTH                  0x00000001

#define _SPI1CON1_MSTEN_POSITION                 0x00000005
#define _SPI1CON1_MSTEN_MASK                     0x00000020
#define _SPI1CON1_MSTEN_LENGTH                   0x00000001

#define _SPI1CON1_CKP_POSITION                   0x00000006
#define _SPI1CON1_CKP_MASK                       0x00000040
#define _SPI1CON1_CKP_LENGTH                     0x00000001

#define _SPI1CON1_SSEN_POSITION                  0x00000007
#define _SPI1CON1_SSEN_MASK                      0x00000080
#define _SPI1CON1_SSEN_LENGTH                    0x00000001

#define _SPI1CON1_CKE_POSITION                   0x00000008
#define _SPI1CON1_CKE_MASK                       0x00000100
#define _SPI1CON1_CKE_LENGTH                     0x00000001

#define _SPI1CON1_SMP_POSITION                   0x00000009
#define _SPI1CON1_SMP_MASK                       0x00000200
#define _SPI1CON1_SMP_LENGTH                     0x00000001

#define _SPI1CON1_MODE16_POSITION                0x0000000A
#define _SPI1CON1_MODE16_MASK                    0x00000400
#define _SPI1CON1_MODE16_LENGTH                  0x00000001

#define _SPI1CON1_MODE32_POSITION                0x0000000B
#define _SPI1CON1_MODE32_MASK                    0x00000800
#define _SPI1CON1_MODE32_LENGTH                  0x00000001

#define _SPI1CON1_DISSDO_POSITION                0x0000000C
#define _SPI1CON1_DISSDO_MASK                    0x00001000
#define _SPI1CON1_DISSDO_LENGTH                  0x00000001

#define _SPI1CON1_SPISIDL_POSITION               0x0000000D
#define _SPI1CON1_SPISIDL_MASK                   0x00002000
#define _SPI1CON1_SPISIDL_LENGTH                 0x00000001

#define _SPI1CON1_SPIEN_POSITION                 0x0000000F
#define _SPI1CON1_SPIEN_MASK                     0x00008000
#define _SPI1CON1_SPIEN_LENGTH                   0x00000001

#define _SPI1CON1_MODE_POSITION                  0x0000000A
#define _SPI1CON1_MODE_MASK                      0x00000C00
#define _SPI1CON1_MODE_LENGTH                    0x00000002

#define _SPI1CON1L_ENHBUF_POSITION               0x00000000
#define _SPI1CON1L_ENHBUF_MASK                   0x00000001
#define _SPI1CON1L_ENHBUF_LENGTH                 0x00000001

#define _SPI1CON1L_SPIFE_POSITION                0x00000001
#define _SPI1CON1L_SPIFE_MASK                    0x00000002
#define _SPI1CON1L_SPIFE_LENGTH                  0x00000001

#define _SPI1CON1L_MCLKEN_POSITION               0x00000002
#define _SPI1CON1L_MCLKEN_MASK                   0x00000004
#define _SPI1CON1L_MCLKEN_LENGTH                 0x00000001

