MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
#define _CLC4SEL_DS42_POSITION                   0x0000000E
#define _CLC4SEL_DS42_MASK                       0x00004000
#define _CLC4SEL_DS42_LENGTH                     0x00000001

#define _CLC4SELL_DS1_POSITION                   0x00000000
#define _CLC4SELL_DS1_MASK                       0x00000007
#define _CLC4SELL_DS1_LENGTH                     0x00000003

#define _CLC4SELL_DS2_POSITION                   0x00000004
#define _CLC4SELL_DS2_MASK                       0x00000070
#define _CLC4SELL_DS2_LENGTH                     0x00000003

#define _CLC4SELL_DS3_POSITION                   0x00000008
#define _CLC4SELL_DS3_MASK                       0x00000700
#define _CLC4SELL_DS3_LENGTH                     0x00000003

#define _CLC4SELL_DS4_POSITION                   0x0000000C
#define _CLC4SELL_DS4_MASK                       0x00007000
#define _CLC4SELL_DS4_LENGTH                     0x00000003

#define _CLC4SELL_DS10_POSITION                  0x00000000
#define _CLC4SELL_DS10_MASK                      0x00000001
#define _CLC4SELL_DS10_LENGTH                    0x00000001

#define _CLC4SELL_DS11_POSITION                  0x00000001
#define _CLC4SELL_DS11_MASK                      0x00000002
#define _CLC4SELL_DS11_LENGTH                    0x00000001

#define _CLC4SELL_DS12_POSITION                  0x00000002
#define _CLC4SELL_DS12_MASK                      0x00000004
#define _CLC4SELL_DS12_LENGTH                    0x00000001

#define _CLC4SELL_DS20_POSITION                  0x00000004
#define _CLC4SELL_DS20_MASK                      0x00000010
#define _CLC4SELL_DS20_LENGTH                    0x00000001

#define _CLC4SELL_DS21_POSITION                  0x00000005
#define _CLC4SELL_DS21_MASK                      0x00000020
#define _CLC4SELL_DS21_LENGTH                    0x00000001

#define _CLC4SELL_DS22_POSITION                  0x00000006
#define _CLC4SELL_DS22_MASK                      0x00000040
#define _CLC4SELL_DS22_LENGTH                    0x00000001

#define _CLC4SELL_DS30_POSITION                  0x00000008
#define _CLC4SELL_DS30_MASK                      0x00000100
#define _CLC4SELL_DS30_LENGTH                    0x00000001

#define _CLC4SELL_DS31_POSITION                  0x00000009
#define _CLC4SELL_DS31_MASK                      0x00000200
#define _CLC4SELL_DS31_LENGTH                    0x00000001

#define _CLC4SELL_DS32_POSITION                  0x0000000A
#define _CLC4SELL_DS32_MASK                      0x00000400
#define _CLC4SELL_DS32_LENGTH                    0x00000001

#define _CLC4SELL_DS40_POSITION                  0x0000000C
#define _CLC4SELL_DS40_MASK                      0x00001000
#define _CLC4SELL_DS40_LENGTH                    0x00000001

#define _CLC4SELL_DS41_POSITION                  0x0000000D
#define _CLC4SELL_DS41_MASK                      0x00002000
#define _CLC4SELL_DS41_LENGTH                    0x00000001

#define _CLC4SELL_DS42_POSITION                  0x0000000E
#define _CLC4SELL_DS42_MASK                      0x00004000
#define _CLC4SELL_DS42_LENGTH                    0x00000001

#define _CLC4GLSL_G1D1N_POSITION                 0x00000000
#define _CLC4GLSL_G1D1N_MASK                     0x00000001
#define _CLC4GLSL_G1D1N_LENGTH                   0x00000001

#define _CLC4GLSL_G1D1T_POSITION                 0x00000001
#define _CLC4GLSL_G1D1T_MASK                     0x00000002
#define _CLC4GLSL_G1D1T_LENGTH                   0x00000001

#define _CLC4GLSL_G1D2N_POSITION                 0x00000002
#define _CLC4GLSL_G1D2N_MASK                     0x00000004
#define _CLC4GLSL_G1D2N_LENGTH                   0x00000001

#define _CLC4GLSL_G1D2T_POSITION                 0x00000003
#define _CLC4GLSL_G1D2T_MASK                     0x00000008
#define _CLC4GLSL_G1D2T_LENGTH                   0x00000001

#define _CLC4GLSL_G1D3N_POSITION                 0x00000004
#define _CLC4GLSL_G1D3N_MASK                     0x00000010
#define _CLC4GLSL_G1D3N_LENGTH                   0x00000001

#define _CLC4GLSL_G1D3T_POSITION                 0x00000005
#define _CLC4GLSL_G1D3T_MASK                     0x00000020
#define _CLC4GLSL_G1D3T_LENGTH                   0x00000001

#define _CLC4GLSL_G1D4N_POSITION                 0x00000006
#define _CLC4GLSL_G1D4N_MASK                     0x00000040
#define _CLC4GLSL_G1D4N_LENGTH                   0x00000001

#define _CLC4GLSL_G1D4T_POSITION                 0x00000007
#define _CLC4GLSL_G1D4T_MASK                     0x00000080
#define _CLC4GLSL_G1D4T_LENGTH                   0x00000001

#define _CLC4GLSL_G2D1N_POSITION                 0x00000008
#define _CLC4GLSL_G2D1N_MASK                     0x00000100
#define _CLC4GLSL_G2D1N_LENGTH                   0x00000001

#define _CLC4GLSL_G2D1T_POSITION                 0x00000009
#define _CLC4GLSL_G2D1T_MASK                     0x00000200
#define _CLC4GLSL_G2D1T_LENGTH                   0x00000001

#define _CLC4GLSL_G2D2N_POSITION                 0x0000000A
#define _CLC4GLSL_G2D2N_MASK                     0x00000400
#define _CLC4GLSL_G2D2N_LENGTH                   0x00000001

#define _CLC4GLSL_G2D2T_POSITION                 0x0000000B
#define _CLC4GLSL_G2D2T_MASK                     0x00000800
#define _CLC4GLSL_G2D2T_LENGTH                   0x00000001

#define _CLC4GLSL_G2D3N_POSITION                 0x0000000C
#define _CLC4GLSL_G2D3N_MASK                     0x00001000
#define _CLC4GLSL_G2D3N_LENGTH                   0x00000001

#define _CLC4GLSL_G2D3T_POSITION                 0x0000000D
#define _CLC4GLSL_G2D3T_MASK                     0x00002000
#define _CLC4GLSL_G2D3T_LENGTH                   0x00000001

#define _CLC4GLSL_G2D4N_POSITION                 0x0000000E
#define _CLC4GLSL_G2D4N_MASK                     0x00004000
#define _CLC4GLSL_G2D4N_LENGTH                   0x00000001

#define _CLC4GLSL_G2D4T_POSITION                 0x0000000F
#define _CLC4GLSL_G2D4T_MASK                     0x00008000
#define _CLC4GLSL_G2D4T_LENGTH                   0x00000001

#define _CLC4GLSH_G3D1N_POSITION                 0x00000000
#define _CLC4GLSH_G3D1N_MASK                     0x00000001
#define _CLC4GLSH_G3D1N_LENGTH                   0x00000001

#define _CLC4GLSH_G3D1T_POSITION                 0x00000001
#define _CLC4GLSH_G3D1T_MASK                     0x00000002
#define _CLC4GLSH_G3D1T_LENGTH                   0x00000001

#define _CLC4GLSH_G3D2N_POSITION                 0x00000002
#define _CLC4GLSH_G3D2N_MASK                     0x00000004
#define _CLC4GLSH_G3D2N_LENGTH                   0x00000001

#define _CLC4GLSH_G3D2T_POSITION                 0x00000003
#define _CLC4GLSH_G3D2T_MASK                     0x00000008
#define _CLC4GLSH_G3D2T_LENGTH                   0x00000001

