MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
#define _IOCNF_IOCNF0_POSITION                   0x00000000
#define _IOCNF_IOCNF0_MASK                       0x00000001
#define _IOCNF_IOCNF0_LENGTH                     0x00000001

#define _IOCNF_IOCNF1_POSITION                   0x00000001
#define _IOCNF_IOCNF1_MASK                       0x00000002
#define _IOCNF_IOCNF1_LENGTH                     0x00000001

#define _IOCNF_IOCNF2_POSITION                   0x00000002
#define _IOCNF_IOCNF2_MASK                       0x00000004
#define _IOCNF_IOCNF2_LENGTH                     0x00000001

#define _IOCNF_IOCNF3_POSITION                   0x00000003
#define _IOCNF_IOCNF3_MASK                       0x00000008
#define _IOCNF_IOCNF3_LENGTH                     0x00000001

#define _IOCNF_IOCNF4_POSITION                   0x00000004
#define _IOCNF_IOCNF4_MASK                       0x00000010
#define _IOCNF_IOCNF4_LENGTH                     0x00000001

#define _IOCNF_IOCNF5_POSITION                   0x00000005
#define _IOCNF_IOCNF5_MASK                       0x00000020
#define _IOCNF_IOCNF5_LENGTH                     0x00000001

#define _IOCNF_IOCNF6_POSITION                   0x00000006
#define _IOCNF_IOCNF6_MASK                       0x00000040
#define _IOCNF_IOCNF6_LENGTH                     0x00000001

#define _IOCFF_IOCFF0_POSITION                   0x00000000
#define _IOCFF_IOCFF0_MASK                       0x00000001
#define _IOCFF_IOCFF0_LENGTH                     0x00000001

#define _IOCFF_IOCFF1_POSITION                   0x00000001
#define _IOCFF_IOCFF1_MASK                       0x00000002
#define _IOCFF_IOCFF1_LENGTH                     0x00000001

#define _IOCFF_IOCFF2_POSITION                   0x00000002
#define _IOCFF_IOCFF2_MASK                       0x00000004
#define _IOCFF_IOCFF2_LENGTH                     0x00000001

#define _IOCFF_IOCFF3_POSITION                   0x00000003
#define _IOCFF_IOCFF3_MASK                       0x00000008
#define _IOCFF_IOCFF3_LENGTH                     0x00000001

#define _IOCFF_IOCFF4_POSITION                   0x00000004
#define _IOCFF_IOCFF4_MASK                       0x00000010
#define _IOCFF_IOCFF4_LENGTH                     0x00000001

#define _IOCFF_IOCFF5_POSITION                   0x00000005
#define _IOCFF_IOCFF5_MASK                       0x00000020
#define _IOCFF_IOCFF5_LENGTH                     0x00000001

#define _IOCFF_IOCFF6_POSITION                   0x00000006
#define _IOCFF_IOCFF6_MASK                       0x00000040
#define _IOCFF_IOCFF6_LENGTH                     0x00000001

#define _CNPUF_IOCPF0_POSITION                   0x00000000
#define _CNPUF_IOCPF0_MASK                       0x00000001
#define _CNPUF_IOCPF0_LENGTH                     0x00000001

#define _CNPUF_IOCPF1_POSITION                   0x00000001
#define _CNPUF_IOCPF1_MASK                       0x00000002
#define _CNPUF_IOCPF1_LENGTH                     0x00000001

#define _CNPUF_IOCPF2_POSITION                   0x00000002
#define _CNPUF_IOCPF2_MASK                       0x00000004
#define _CNPUF_IOCPF2_LENGTH                     0x00000001

#define _CNPUF_IOCPF3_POSITION                   0x00000003
#define _CNPUF_IOCPF3_MASK                       0x00000008
#define _CNPUF_IOCPF3_LENGTH                     0x00000001

#define _CNPUF_IOCPF4_POSITION                   0x00000004
#define _CNPUF_IOCPF4_MASK                       0x00000010
#define _CNPUF_IOCPF4_LENGTH                     0x00000001

#define _CNPUF_IOCPF5_POSITION                   0x00000005
#define _CNPUF_IOCPF5_MASK                       0x00000020
#define _CNPUF_IOCPF5_LENGTH                     0x00000001

#define _CNPUF_IOCPF6_POSITION                   0x00000006
#define _CNPUF_IOCPF6_MASK                       0x00000040
#define _CNPUF_IOCPF6_LENGTH                     0x00000001

#define _CNPUF_IOCPUF0_POSITION                  0x00000000
#define _CNPUF_IOCPUF0_MASK                      0x00000001
#define _CNPUF_IOCPUF0_LENGTH                    0x00000001

#define _CNPUF_IOCPUF1_POSITION                  0x00000001
#define _CNPUF_IOCPUF1_MASK                      0x00000002
#define _CNPUF_IOCPUF1_LENGTH                    0x00000001

#define _CNPUF_IOCPUF2_POSITION                  0x00000002
#define _CNPUF_IOCPUF2_MASK                      0x00000004
#define _CNPUF_IOCPUF2_LENGTH                    0x00000001

#define _CNPUF_IOCPUF3_POSITION                  0x00000003
#define _CNPUF_IOCPUF3_MASK                      0x00000008
#define _CNPUF_IOCPUF3_LENGTH                    0x00000001

#define _CNPUF_IOCPUF4_POSITION                  0x00000004
#define _CNPUF_IOCPUF4_MASK                      0x00000010
#define _CNPUF_IOCPUF4_LENGTH                    0x00000001

#define _CNPUF_IOCPUF5_POSITION                  0x00000005
#define _CNPUF_IOCPUF5_MASK                      0x00000020
#define _CNPUF_IOCPUF5_LENGTH                    0x00000001

#define _CNPUF_IOCPUF6_POSITION                  0x00000006
#define _CNPUF_IOCPUF6_MASK                      0x00000040
#define _CNPUF_IOCPUF6_LENGTH                    0x00000001

#define _CNPUF_CNPUF0_POSITION                   0x00000000
#define _CNPUF_CNPUF0_MASK                       0x00000001
#define _CNPUF_CNPUF0_LENGTH                     0x00000001

#define _CNPUF_CNPUF1_POSITION                   0x00000001
#define _CNPUF_CNPUF1_MASK                       0x00000002
#define _CNPUF_CNPUF1_LENGTH                     0x00000001

#define _CNPUF_CNPUF2_POSITION                   0x00000002
#define _CNPUF_CNPUF2_MASK                       0x00000004
#define _CNPUF_CNPUF2_LENGTH                     0x00000001

#define _CNPUF_CNPUF3_POSITION                   0x00000003
#define _CNPUF_CNPUF3_MASK                       0x00000008
#define _CNPUF_CNPUF3_LENGTH                     0x00000001

#define _CNPUF_CNPUF4_POSITION                   0x00000004
#define _CNPUF_CNPUF4_MASK                       0x00000010
#define _CNPUF_CNPUF4_LENGTH                     0x00000001

#define _CNPUF_CNPUF5_POSITION                   0x00000005
#define _CNPUF_CNPUF5_MASK                       0x00000020
#define _CNPUF_CNPUF5_LENGTH                     0x00000001

#define _CNPUF_CNPUF6_POSITION                   0x00000006
#define _CNPUF_CNPUF6_MASK                       0x00000040
#define _CNPUF_CNPUF6_LENGTH                     0x00000001

#define _IOCPUF_IOCPF0_POSITION                  0x00000000
#define _IOCPUF_IOCPF0_MASK                      0x00000001
#define _IOCPUF_IOCPF0_LENGTH                    0x00000001

#define _IOCPUF_IOCPF1_POSITION                  0x00000001
#define _IOCPUF_IOCPF1_MASK                      0x00000002
#define _IOCPUF_IOCPF1_LENGTH                    0x00000001

#define _IOCPUF_IOCPF2_POSITION                  0x00000002
#define _IOCPUF_IOCPF2_MASK                      0x00000004
#define _IOCPUF_IOCPF2_LENGTH                    0x00000001

#define _IOCPUF_IOCPF3_POSITION                  0x00000003
#define _IOCPUF_IOCPF3_MASK                      0x00000008
#define _IOCPUF_IOCPF3_LENGTH                    0x00000001

