MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA606/mcu.h
/* Register FSIGN (0xaf14)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSIGN;
#define _FSIGN(x) __attribute__((address(0xaf14),deprecated_definition("consider migrating to #pragma config"),section("__FSIGN.sec"),space(prog))) __prog__ uint16_t _FSIGN = (x);

/*
** Only one invocation of FSIGN should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSIGN.
** Multiple options may be combined, as shown:
**
** _FSIGN( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FOSCSEL (0xaf18)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0xaf18),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Source Selection:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with divide-by-N with PLL module (FRCPLL) 
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_DCO            Digitally-Controlled Oscillator
**     FNOSC_OSCFDIV        Oscillator with Frequency Divider
**
**   PLL Mode Selection:
**     PLLMODE_PLL96DIV1    96 MHz PLL.  (4 MHz input)
**     PLLMODE_PLL96DIV2    96 MHz PLL. (8 MHz input)
**     PLLMODE_PLL96DIV3    96 MHz PLL. (12 MHz input)
**     PLLMODE_PLL96DIV4    96 MHz PLL.  (16 MHz input)
**     PLLMODE_PLL96DIV5    96 MHz PLL. (20 MHz input)
**     PLLMODE_PLL96DIV6    96 MHz PLL.  (24 MHz input)
**     PLLMODE_PLL96DIV8    96 MHz PLL.  (32 MHz input)
**     PLLMODE_PLL96DIV12   96 MHz PLL.  (48 MHz input)
**     PLLMODE_PLL4X        4x PLL selected
**     PLLMODE_PLL6X        6x PLL selected
**     PLLMODE_PLL8X        8x PLL selected
**     PLLMODE_DISABLED     No PLL used; PLLEN bit is not available
**
**   Two-speed Oscillator Start-up Enable bit:
**     IESO_OFF             Start up with user-selected oscillator source
**     IESO_ON              Start up device with FRC, then switch to user-selected oscillator source
**
*/

#define FNOSC_FRC            0x00F8
#define FNOSC_FRCPLL         0x00F9
#define FNOSC_PRI            0x00FA
#define FNOSC_PRIPLL         0x00FB
#define FNOSC_SOSC           0x00FC
#define FNOSC_LPRC           0x00FD
#define FNOSC_DCO            0x00FE
#define FNOSC_OSCFDIV        0x00FF

#define PLLMODE_PLL96DIV1    0x0087
#define PLLMODE_PLL96DIV2    0x008F
#define PLLMODE_PLL96DIV3    0x0097
#define PLLMODE_PLL96DIV4    0x009F
#define PLLMODE_PLL96DIV5    0x00A7
#define PLLMODE_PLL96DIV6    0x00AF
#define PLLMODE_PLL96DIV8    0x00B7
#define PLLMODE_PLL96DIV12   0x00BF
#define PLLMODE_PLL4X        0x00E7
#define PLLMODE_PLL6X        0x00EF
#define PLLMODE_PLL8X        0x00F7
#define PLLMODE_DISABLED     0x00FF

#define IESO_OFF             0x007F
#define IESO_ON              0x00FF

/* Register FOSC (0xaf1c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xaf1c),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Mode Select bits:
**     POSCMD_EC            EC (External Clock) Mode
**     POSCMD_XT            XT Crystal Oscillator Mode
**     POSCMD_HS            HS Crystal Oscillator Mode
**     POSCMD_NONE          Primary Oscillator disabled
**
**   OSC2 Pin Function bit:
**     OSCIOFCN_ON          OSC2 is general purpose digital I/O pin
**     OSCIOFCN_OFF         OSC2 is clock output
**
**   SOSC Power Selection Configuration bits:
**     SOSCSEL_OFF          Digital (SCLKI) mode
**     SOSCSEL_ON           SOSC is used in crystal (SOSCI/SOSCO) mode
**
**   PLL Secondary Selection Configuration bit:
**     PLLSS_PLL_FRC        PLL is fed by the on-chip Fast RC (FRC) oscillator
**     PLLSS_PLL_PRI        PLL is fed by the Primary oscillator
**
**   Peripheral pin select configuration bit:
**     IOL1WAY_OFF          Allow multiple reconfigurations
**     IOL1WAY_ON           Allow only one reconfiguration
**
**   Clock Switching Mode bits:
**     FCKSM_CSECME         Both Clock switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock switching is enabled,Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock switching and Fail-safe Clock Monitor are disabled
**
*/

#define POSCMD_EC            0x00FC
#define POSCMD_XT            0x00FD
#define POSCMD_HS            0x00FE
#define POSCMD_NONE          0x00FF

#define OSCIOFCN_ON          0x00FB
#define OSCIOFCN_OFF         0x00FF

#define SOSCSEL_OFF          0x00F7
#define SOSCSEL_ON           0x00FF

#define PLLSS_PLL_FRC        0x00EF
#define PLLSS_PLL_PRI        0x00FF

#define IOL1WAY_OFF          0x00DF
#define IOL1WAY_ON           0x00FF

#define FCKSM_CSECME         0x003F
#define FCKSM_CSECMD         0x007F
#define FCKSM_CSDCMD         0x00BF

/* Register FWDT (0xaf20)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xaf20),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

